# Brewfile for GrantBirki's bootstrap tap
# Use this with `brew bundle --file=Brewfile`

# Ensure the tap is available locally so tap-specific formulae (like pinned crystal) can be installed
tap "grantbirki/tap"


### Personal Tools I Maintain ###

# Fast and statically typed, compiled language with Ruby-like syntax
brew "grantbirki/tap/crystal"
# CLI tool for macOS to uninstall an app from your system
brew "grantbirki/tap/uninstall"


# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Go version management
brew "goenv"
# Display directories as trees
brew "tree"
# Node.js version manager
brew "nodenv"
# rust and rustup
brew "rustup"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python version management
brew "pyenv"
# Ruby version manager
brew "rbenv"
# GPU-accelerated terminal emulator
cask "alacritty"
# Keyboard customiser
cask "karabiner-elements"
# Password manager app
cask "keepassxc"
# Window switcher
cask "alt-tab"
# https://formulae.brew.sh/cask/imageoptim#default
cask "imageoptim"
# https://formulae.brew.sh/cask/raspberry-pi-imager#default
cask "raspberry-pi-imager"
